app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("e_name", "sal", "place", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["e_name", "Janardan"], ["sal", 12000.0], ["place", "karnataka"], ["created_at", "2022-11-22 09:38:28.081164"], ["updated_at", "2022-11-22 09:38:28.081164"]]