app/controllers/students_controller.rb

INSERT INTO "students" ("name", "std", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Tapas"], ["std", 11], ["created_at", "2022-11-28 17:03:54.449468"], ["updated_at", "2022-11-28 17:03:54.449468"]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save